Revit 2026 API

# TableCellStyleSetCellStyleOverrideOptions Method

---

Sets cell style override options of this cell.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCellStyleOverrideOptions(
	TableCellStyleOverrideOptions helper
)
```
```vb
Public Sub SetCellStyleOverrideOptions (
	helper As TableCellStyleOverrideOptions
)
```
```cpp
public:
void SetCellStyleOverrideOptions(
	TableCellStyleOverrideOptions^ helper
)
```
```fsharp
member SetCellStyleOverrideOptions :
        helper : TableCellStyleOverrideOptions -> unit
```

#### Parameters

helper TableCellStyleOverrideOptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

TableCellStyle Class

Autodesk.Revit.DB Namespace